app/controllers/admin/billings_controller.rb

  def edit
    @billing = Billing.find(params[:id])
---
SELECT `billings`.* FROM `billings` WHERE `billings`.`id` = 1 LIMIT 1

  def update
    @billing = Billing.find(params[:id])
    if @billing.update_attributes(params[:billing])
---
SELECT `billings`.* FROM `billings` WHERE `billings`.`id` = 1 LIMIT 1
UPDATE `billings` SET `done` = 1, `updated_at` = '2013-02-04 17:39:04' WHERE `billings`.`id` = 1