app/controllers/admin/consignments_controller.rb

  def index
    @consignments = Consignment.paginate(page: params[:page])
---
SELECT `consignments`.* FROM `consignments` LIMIT 30 OFFSET 0

  def edit
    @consignment = Consignment.find(params[:id])
---
SELECT `consignments`.* FROM `consignments` WHERE `consignments`.`id` = 1 LIMIT 1

  def update
    @consignment = Consignment.find(params[:id])
---
SELECT `consignments`.* FROM `consignments` WHERE `consignments`.`id` = 1 LIMIT 1

  def show
    @consignment = Consignment.find(params[:id])
    @products = @consignment.consignment_products.paginate(page: params[:page])
---
SELECT `consignments`.* FROM `consignments` WHERE `consignments`.`id` = 2 LIMIT 1
SELECT `consignment_products`.* FROM `consignment_products` WHERE `consignment_products`.`consignment_id` = 2 LIMIT 30 OFFSET 0