app/controllers/admin/products_controller.rb

  def index
    @products = Product.paginate(:page => params[:page])
---
SELECT `products`.* FROM `products` ORDER BY created_at desc LIMIT 30 OFFSET 0

  def create
    @product = current_user.products.build(params[:product])

    if @product.save
---
INSERT INTO `products` (`category_id`, `created_at`, `description`, `name`, `notice`, `original_price`, `pattern`, `price`, `ruten_no`, `status`, `updated_at`, `user_id`) VALUES (NULL, '2013-02-07 15:51:24', '《年終獎金Best Buy》\r\n開始﹕２／０７(星期四) １０：００ \r\n結束﹕２／１８(星期一) １０：００ \r\n特價﹕原價$2200．限時價↘$1599\r\n活動結束保證調回原價\r\n\r\n◆9 ~ 14 kg 適用\r\n◆吸收體再增量4%，吸收力 up\r\n◆瞬吸不濕黏\r\n◆日本 NO.1 技術合作\r\n\r\n\r\n→還有 【S 75片X4包/箱】可選\r\n→還有 【M 60片X4包/箱】可選\r\n→還有 【XL 42片X4包/箱】可選 ', '滿意寶寶 瞬潔乾爽 L 紙尿褲 200片/箱', '《年終獎金Best Buy》\r\n開始﹕２／０７(星期四) １０：００ \r\n結束﹕２／１８(星期一) １０：００ \r\n特價﹕原價$2200．限時價↘$1599\r\n活動結束保證調回原價\r\n\r\n◆9 ~ 14 kg 適用\r\n◆吸收體再增量4%，吸收力 up\r\n◆瞬吸不濕黏\r\n◆日本 NO.1 技術合作\r\n\r\n\r\n→還有 【S 75片X4包/箱】可選\r\n→還有 【M 60片X4包/箱】可選\r\n→還有 【XL 42片X4包/箱】可選 ', 0, NULL, 1000, '123', 'selling', '2013-02-07 15:51:24', 1)