app/views/billings/create.js.erb

$("#billing_btn").fadeOut();
$("<div class='alert alert-success'><h5>已接到您的請款申請，請耐心等候我們會儘快為您處理</h5></div>").insertAfter("#billing_alert");
---
INSERT INTO `billings` (`amount`, `created_at`, `done`, `updated_at`, `user_id`) VALUES (1000, '2013-02-04 16:29:11', 0, '2013-02-04 16:29:11', 1)