app/controllers/billings_controller.rb

INSERT INTO `billings` (`amount`, `created_at`, `done`, `updated_at`, `user_id`) VALUES (1000, '2013-02-04 16:29:11', 0, '2013-02-04 16:29:11', 1)
---
  def create
    @billing = @user.billings.build(amount: @user.money_can_apply)
    if @billing.save

SELECT `billings`.* FROM `billings` WHERE `billings`.`user_id` = 1 LIMIT 30 OFFSET 0
---
  def index
    @billings = @user.billings.paginate(page: params[:page])