app/controllers/consignments_controller.rb

SELECT `consignments`.* FROM `consignments` WHERE `consignments`.`user_id` = 1 LIMIT 30 OFFSET 0
---
  def index
    @consignments = current_user.consignments.paginate(page: params[:page])

SELECT `consignments`.* FROM `consignments` WHERE `consignments`.`user_id` = 1 AND `consignments`.`id` = 1 LIMIT 1
SELECT `consignment_products`.* FROM `consignment_products` WHERE `consignment_products`.`consignment_id` = 1 LIMIT 30 OFFSET 0
---
  def show
    @consignment = current_user.consignments.find(params[:id])
    @products = @consignment.consignment_products.paginate(page: params[:page])

INSERT INTO `consignments` (`account`, `account_num`, `address`, `allow_fix`, `argu_price`, `attachment`, `attachment_processing`, `attachment_tmp`, `balance`, `bank`, `bank_num`, `chinese_name`, `created_at`, `payed`, `phone`, `status`, `updated_at`, `user_id`) VALUES ('123', '123', 'blah', 0, 0, NULL, NULL, NULL, 0, '123', '123', '郭啓賓', '2013-02-04 12:38:18', NULL, 'blah', 'waiting', '2013-02-04 12:38:18', 1)
---
  def create
    @consignment = current_user.consignments.build(params[:consignment].
                                                   slice(:consignment_products_attributes,
                                                         :chinese_name,
                                                         :address,
                                                         :phone,
                                                         :bank,
                                                         :bank_num,
                                                         :account,
                                                         :account_num))
    @consignment.status = 'waiting'
    if @consignment.save