app/controllers/products_controller.rb

  def index
    if params[:tag]
      @products = Product.available.tagged_with(params[:tag]).paginate(:page => params[:page])
---
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` INNER JOIN products ON products.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Product' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT products.id FROM `products` ORDER BY created_at desc)) GROUP BY taggings.tag_id HAVING COUNT(taggings.tag_id) > 0) AS taggings ON taggings.tag_id = tags.id