app/views/consignments/index.html.slim

SELECT `consignment_products`.* FROM `consignment_products` WHERE `consignment_products`.`consignment_id` = 1
---
          - @consignments.each do |consignment|
            - consignment.consignment_products.each do |product|