app/views/products/_products.html.slim

SELECT COUNT(*) FROM `product_images` WHERE `product_images`.`product_id` = 1
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 1 LIMIT 1
---
      .thumbnail
        - if a.product_images.size > 0
          .product-image